# NOTES

### general notes

this notebook is intended to be used to practice SQL (MySQL) through individual questions, as well as gather notes on common topics, best practices, and any information that is new to me. studying SQL courses does not seem to be very effective for various reasons (slow, repetitive but information doesn't seem to stick, boring); trying this approach instead. will attempt to implement what is learned in projects further down the line. 

have not currently found a way to format this notebook nicely, so mostly only using markdown cells. doesn't look great but will do for now

1. problems denoted by * proved to be quite challenging for me upon first attempt
2. problems denoted by ** are exceedingly challenging and will require a lot of revision
3. problems denoted by @ remain incomplete
4. in leetcode, problems with notes in green are first attempts/solutions or reworks after failure. those with notes in blue are review

### study notes

getting to a point where i may have practiced enough, and it would now be useful to delve more into concepts/theory so i better understand what am i doing and why it works. might be useful to go over a number of built in functions & other tools in SQL in order to actually be able to solve medium problems

1. study in more depth aggregations functions (COUNT(), SUM(), MAX(), AVG(), etc.) and their impact on GROUP BY and ORDER BY clauses:
    1. COUNT(), SUM(), etc. before the grouping
    2. GROUP BY itself
    3. aggregations performed after the grouping - HAVING COUNT(), SUM(), etc.
2. study order of operations (which clauses come first, and which statements are performed first and why - are they all executed purely in sequence, or is that syntax?)
3. difference between a derived table and subquery? 
4. **maybe go over every problem and add some concept keywords in the title in order to make it easier to review certain topics (this should be done soon, as many concepts have been encountered so far, and some of them not very clear. understanding them would help solidify the foundation)**
5. need to look into how partitions work in more detail

## Easy Problems

### 175. Combine Two Tables

#### <u>description</u>

Table: Person

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | personId    | int     |
    | lastName    | varchar |
    | firstName   | varchar |
    +-------------+---------+

personId is the primary key (column with unique values) for this table.
This table contains information about the ID of some persons and their first and last names.

Table: Address

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | addressId   | int     |
    | personId    | int     |
    | city        | varchar |
    | state       | varchar |
    +-------------+---------+

addressId is the primary key (column with unique values) for this table.
Each row of this table contains information about the city and state of one person with ID = PersonId.

Write a solution to report the first name, last name, city, and state of each person in the Person table. If the address of a personId is not present in the Address table, report null instead.

Return the result table in any order.

#### <u>attempts</u>

NOTE: need a left join

    SELECT person.firstName, person.LastName, address.city, address.state
    FROM Person person
    LEFT JOIN Address address ON person.personId = address.personId 
    
status = success

#### <u>solutions</u>

from someone on leetcode, haven't seen this before

    SELECT firstname, lastname, city, state FROM person
    LEFT JOIN address USING(personid)

#### <u>notes</u>

on joins: To combine two SQL tables based on a common ID, you typically use a JOIN operation. The most common types of joins are INNER JOIN, LEFT JOIN (or LEFT OUTER JOIN), RIGHT JOIN (or RIGHT OUTER JOIN), and FULL JOIN (or FULL OUTER JOIN). Here's a brief explanation of each:

1. INNER JOIN: Combines rows from both tables only when there is a match on the specified column (common ID). Rows without matching values in either table are excluded.

2. LEFT JOIN (LEFT OUTER JOIN): Combines all rows from the left table and the matched rows from the right table. If there is no match, NULL values are returned for columns from the right table.

3. RIGHT JOIN (RIGHT OUTER JOIN): Combines all rows from the right table and the matched rows from the left table. If there is no match, NULL values are returned for columns from the left table.

4. FULL JOIN (FULL OUTER JOIN): Combines rows when there is a match in one of the tables. Rows without matching values in either table will also be included, with NULL values for columns from the table that lacks a match.

Example of LEFT JOIN:

    SELECT a.id, a.column1, a.column2, b.column3, b.column4
    FROM table1 a
    LEFT JOIN table2 b ON a.id = b.id;
    
In this query:

* table1 and table2 are the tables you want to combine.
* a and b are aliases for table1 and table2, respectively.
* id is the common column in both tables.

Example of FULL JOIN:

Some databases like MySQL do not support FULL JOIN. You might need to use a combination of LEFT JOIN and RIGHT JOIN with a UNION in such cases. If you need to ensure compatibility across different SQL databases, you can use a UNION to simulate a FULL JOIN:

    SELECT a.id, a.column1, a.column2, b.column3, b.column4
    FROM table1 a
    LEFT JOIN table2 b ON a.id = b.id
    UNION
    SELECT a.id, a.column1, a.column2, b.column3, b.column4
    FROM table1 a
    RIGHT JOIN table2 b ON a.id = b.id;
   
**the above code on the FULL JOIN is from GPT and has not been tested... take with a grain of salt**

### 181. Employees Earning More Than Their Managers

#### <u>description</u>

Table: Employee

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | name        | varchar |
    | salary      | int     |
    | managerId   | int     |
    +-------------+---------+

id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID of an employee, their name, salary, and the ID of their manager.
 

Write a solution to find the employees who earn more than their managers.

Return the result table in any order

#### <u>attempts</u>

NOTE: aliases didn't seem necessary in problem 175, but this problem seems to highlight their importance

    SELECT 
        e1.name AS Employee
    FROM 
        Employee e1
    JOIN 
        Employee e2 ON e1.managerId = e2.id
    WHERE 
        e1.salary > e2.salary;
        
status = success

#### <u>solutions</u>

from leetcode, slightly different approach - no joins seem necessary

    SELECT e1.name AS Employee
    FROM Employee e1, Employee e2
    WHERE e1.managerId = e2.id AND e1.salary > e2.salary;

#### <u>notes</u>

explanation of the attempt: To solve this problem, you can use a self-join on the Employee table to compare each employee's salary with their manager's salary.

* Employee e1 is an alias for the employee table to represent the employees.
* Employee e2 is an alias for the employee table to represent the managers.
* The JOIN clause matches each employee (e1) with their manager (e2) by comparing e1.managerId with e2.id.
* The WHERE clause filters the results to include only those employees whose salary (e1.salary) is greater than their manager's salary (e2.salary).
* The SELECT clause returns the names of the employees who meet the condition.

This query will return the employees who earn more than their managers, as specified in the problem statement

### 182. Duplicate Emails

#### <u>description</u>

Table: Person

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | email       | varchar |
    +-------------+---------+

id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write a solution to report all the duplicate emails. Note that it's guaranteed that the email field is not NULL.

#### <u>attempts</u>

NOTE: haven't used the HAVING keyword before

    SELECT email FROM Person
    GROUP BY email
    HAVING COUNT(email) > 1
    
status = success

#### <u>solutions</u>

this seemed like another popular solution, but doesn't make a whole lot of sense to me...

    SELECT DISTINCT P1.Email FROM Person P1,Person P2 
    WHERE P1.id <> P2.id AND P1.Email=P2.Email
    
here's a breakdown:
1. FROM Person P1, Person P2:

    * This creates two references to the Person table, named P1 and P2. This technique is known as a self-join, where the table is joined with itself.

2. WHERE P1.id <> P2.id:

    * This condition ensures that the join is not comparing the same row with itself by checking that the id of P1 is different from the id of P2.

3. AND P1.Email = P2.Email:

    * This condition ensures that the email addresses in the two rows being compared are the same. This means we are finding pairs of rows where the email is the same but the IDs are different.

4. SELECT DISTINCT P1.Email:

    * SELECT DISTINCT is used to ensure that the result contains unique email addresses. Even if an email appears multiple times as a duplicate in different pairs, it will only be listed once in the result.

#### <u>notes</u>

difference between HAVING and WHERE: The HAVING and WHERE clauses in SQL are both used to filter data, but they are used in different contexts and for different purposes. Here are the key differences:

1. Usage Context:

    * WHERE Clause: The WHERE clause is used to filter rows before any grouping operations are performed. It is applied to individual rows in a table.
    * HAVING Clause: The HAVING clause is used to filter groups after the GROUP BY operation has been performed. It is applied to aggregated data.
    
2. Filtering Rows vs. Filtering Groups
     * WHERE Clause: Filters individual rows based on specified conditions. It cannot be used with aggregate functions (like COUNT, SUM, AVG, etc.) directly. But a WHERE clause can be used before a GROUP BY 
     * HAVING Clause: Filters groups of rows created by the GROUP BY clause based on aggregate function conditions.
     
3. Execution Order:

    * WHERE Clause: Applied early in the execution process, right after the FROM clause.
    * HAVING Clause: Applied later in the execution process, after the GROUP BY clause and any aggregate functions.
    
example

-- Using WHERE clause to filter rows

    SELECT product, amount
    FROM Sales
    WHERE amount > 100;

-- Using HAVING clause to filter groups

    SELECT region, SUM(amount) AS total_sales
    FROM Sales
    GROUP BY region
    HAVING total_sales > 500;

* The first query uses the WHERE clause to filter individual sales records where the amount is greater than 100.
* The second query uses the HAVING clause to filter regions where the total sales (SUM(amount)) exceed 500.

### 183. Customers Who Never Order

#### <u>descriptions</u>

Table: Customers

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | name        | varchar |
    +-------------+---------+
    
id is the primary key (column with unique values) for this table.
Each row of this table indicates the ID and name of a customer.
 

Table: Orders

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | id          | int  |
    | customerId  | int  |
    +-------------+------+
    
id is the primary key (column with unique values) for this table.
customerId is a foreign key (reference columns) of the ID from the Customers table.
Each row of this table indicates the ID of an order and the ID of the customer who ordered it.
 

Write a solution to find all customers who never order anything.

Return the result table in any order.

#### <u>attempts</u>

NOTE: did a right join initially but that didn't make sense because that causes me to lose the names, so have to do left join again

    SELECT name AS Customers
    FROM Customers table1
    LEFT JOIN Orders table2 ON table1.id = table2.customerId
    WHERE table2.id IS NULL
    
status = success

#### <u>solutions</u>

from someone on leetcode, more concise and even eaiser to read

    SELECT name as Customers FROM Customers
    WHERE id NOT IN (SELECT customerid FROM orders)

#### <u>notes</u>

no notes as this time - this problem is fairly straightforward

### 196. Delete Duplicate Emails

#### <u>description</u>

Table: Person

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | email       | varchar |
    +-------------+---------+
    
id is the primary key (column with unique values) for this table.
Each row of this table contains an email. The emails will not contain uppercase letters.
 

Write a solution to delete all duplicate emails, keeping only one unique email with the smallest id.

For SQL users, please note that you are supposed to write a DELETE statement and not a SELECT one.

For Pandas users, please note that you are supposed to modify Person in place.

After running your script, the answer shown is the Person table. The driver will first compile and run your piece of code and then show the Person table. The final order of the Person table does not matter.

#### <u>attempts</u>

NOTE: a bit confused about the WHERE statement; was sure that the condition was t1.id < t2.id since you want to keep the smallest id. same logic for id in the solutions... there's something about the table layout that i don't get from the join

    DELETE t1 FROM Person t1 
    INNER JOIN Person t2 
    WHERE t1.id > t2.id AND t1.email = t2.email
    
status = success

#### <u>solutions</u>

tried to write this but kept failing; need to review syntax

    DELETE p1 FROM Person p1,Person p2 
    WHERE p1.email=p2.email AND p1.id>p2.id

#### <u>notes</u>

would be useful to have a visual view of the table after the inner join so i can understand why that where clause work. explanation:


**Why t1.id > t2.id?**

When there are duplicate rows in the table, we need to choose one of the duplicates to delete. The WHERE t1.id > t2.id condition is used to ensure that we always delete the record with the higher id value and keep the record with the lower id value. This is a consistent and deterministic way to remove duplicates because:

1. Consistency: By always deleting the record with the higher id, we ensure that only one of the duplicates remains. If we used t1.id < t2.id, it would still remove duplicates, but the specific record being deleted would be different (it would be the one with the lower id), which is less intuitive in terms of preserving the original order of insertion.

2. Efficiency: Deleting the record with the higher id can be seen as preserving the "first" instance of each duplicate (assuming id is an auto-incrementing primary key). This is often desirable because it maintains the earliest inserted record.

### 197. Rising Temperature

#### <u>description</u>

Table: Weather

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | id            | int     |
    | recordDate    | date    |
    | temperature   | int     |
    +---------------+---------+
    
id is the column with unique values for this table.
There are no different rows with the same recordDate.
This table contains information about the temperature on a certain day.
 

Write a solution to find all dates' Id with higher temperatures compared to its previous dates (yesterday).

Return the result table in any order.

#### <u>attempts</u>

NOTE: this almost works, but fails if there are gaps between dates...

    SELECT t2.id FROM (
        SELECT *,
        LAG (temperature, 1)
        OVER (ORDER BY recordDate ASC) AS previous_temp
        FROM Weather
    ) AS t2
    WHERE temperature > previous_temp
    
status = failure

NOTE: the idea here was create 2 lagged columns, one for temperature and one for recordDate. in order for an id to be selected, the current temperature had to be greater than the previous one, and the interval between the current day and the previous day had to be exactly 1 day (to ensure the previous record was indeed yesterday). also beats 99.50% of users apparently

    SELECT t2.id FROM (
        SELECT *,
        LAG (temperature, 1)
        OVER (ORDER BY recordDate ASC) AS previous_temp,
        LAG (recordDate, 1)
        OVER (ORDER BY recordDate ASC) AS previous_date
        FROM Weather
    ) AS t2
    WHERE temperature > previous_temp AND DATE_SUB(recordDate, INTERVAL 1 DAY) = previous_date

status = success

#### <u>solutions</u>

solution from someone on leetcode, a lot more straightforward, but not as fast as mine apparently

    SELECT w1.id
    FROM Weather w1, Weather w2
    WHERE DATEDIFF(w1.recordDate, w2.recordDate) = 1 AND w1.temperature > w2.temperature;

#### <u>notes</u>

using 2 new functions in my successful attempt: LAG() and DATE_SUB()

LAG():

The LAG() window function facilitates access to previous rows based on the offset argument. It can be particularly useful when a comparison of a previous value is necessary without the use of a self join. There is a similarity to the LEAD() function with the difference being the accessible rows. LEAD() accesses subsequent rows while LAG() accesses previous rows.

    LAG (expression [, offset] [, default])
    OVER ( [ partition_by ] order_by )

    1. expression - The column value which will be referenced.
    2. offset - A positive numeric indicator of the previous row to access that is relative to the current row. If not specified the default is 1.
    3. default - The value that will be returned if the offset is out of range. This is an optional argument, if not specified NULL will be returned.

    1. partition_by - Allows the result set to be grouped based on a column. This is an optional argument, if not specified the result set will be treated as a single group.
    2. order_by - Determines the order of the result set. If partition_by is specified, it will order the grouped data instead.
    
DATE_SUB():

The DATE_SUB() function subtracts a time/date interval from a date and then returns the date.

    DATE_SUB(date, INTERVAL value interval)
     
    1. date - Required. The date to be modified
    2. value - Required. The value of the time/date interval to subtract. Both positive and negative values are allowed
    3. interval - Required. The type of interval to subtract. Can be one of the following values

### 511. Game Play Analysis I

#### <u>description</u>

Table: Activity

    +--------------+---------+
    | Column Name  | Type    |
    +--------------+---------+
    | player_id    | int     |
    | device_id    | int     |
    | event_date   | date    |
    | games_played | int     |
    +--------------+---------+

(player_id, event_date) is the primary key (combination of columns with unique values) of this table.
This table shows the activity of players of some games.
Each row is a record of a player who logged in and played a number of games (possibly 0) before logging out on someday using some device.
 

Write a solution to find the first login date for each player.

Return the result table in any order.

#### <u>attempts</u>

NOTE: not entirely sure why this works. without the GROUP BY, it only returns a single row which contains the minimum date from the event_date column. possible i fail to really understand what a group by actually does at this stage

    SELECT player_id, MIN(event_date) as first_login
    FROM Activity
    GROUP BY player_id

status = success

#### <u>solutions</u>

there doesn't seem to be much else to this problem. simple problem but worth keeping in mind

#### <u>notes</u>

this is the explanation from GPT concerning the GROUP BY: 
* GROUP BY player_id: This groups the result by player_id, ensuring that the MIN(event_date) is calculated for each player individually.

### 577. Employee Bonus

#### <u>description</u>

Table: Employee

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | empId       | int     |
    | name        | varchar |
    | supervisor  | int     |
    | salary      | int     |
    +-------------+---------+

empId is the column with unique values for this table.
Each row of this table indicates the name and the ID of an employee in addition to their salary and the id of their manager.
 

Table: Bonus

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | empId       | int  |
    | bonus       | int  |
    +-------------+------+

empId is the column of unique values for this table.
empId is a foreign key (reference column) to empId from the Employee table.
Each row of this table contains the id of an employee and their respective bonus.
 

Write a solution to report the name and bonus amount of each employee with a bonus less than 1000.

#### <u>attempts</u>

NOTE: didn't feel like i learned much from this one

    SELECT t1.name, t2.bonus
    FROM Employee t1
    LEFT JOIN Bonus t2 ON t1.empId = t2.empId
    WHERE t2.bonus < 1000 OR t2.bonus IS NULL

status = success

#### <u>solution</u>

a solution from leetcode

    SELECT name, bonus FROM employee
    LEFT JOIN bonus USING(empid)
    WHERE bonus <1000 OR bonus IS NULL

#### <u>notes</u>

difference between ON and USING when joining tables:

1. ON Clause

The ON clause is used to specify the condition on which two tables should be joined. It is flexible and allows you to join tables on columns that have different names, or even use more complex expressions.
    
syntax:

    SELECT columns
    FROM table1
    JOIN table2
    ON table1.column = table2.column;
    
2. USING Clause

The USING clause is used when the columns that are being joined have the same name in both tables. It is a simpler syntax for this specific case.

syntax:

    SELECT columns
    FROM table1
    JOIN table2
    USING (column_name);
    
Key Differences:
1. Column Names:

    * ON can join columns with different names or use more complex conditions.
    * USING requires that the columns being joined have the same name in both tables.
2. Flexibility:

    * ON is more flexible and can handle complex join conditions, including multiple conditions.
    * USING is simpler but limited to cases where the column names are identical. 
3. Resulting Column Names:

    * When using ON, both joined columns will appear in the result set, typically qualified with their table names.
    * When using USING, the resulting table will only include one instance of the joined column, eliminating redundancy.

### 584. Find Customer Referee

#### <u>description</u>

Table: Customer

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | name        | varchar |
    | referee_id  | int     |
    +-------------+---------+
In SQL, id is the primary key column for this table.
Each row of this table indicates the id of a customer, their name, and the id of the customer who referred them.
 

Find the names of the customer that are not referred by the customer with id = 2.

Return the result table in any order.

#### <u>attempts</u>

    SELECT name FROM Customer
    WHERE referee_id <> 2 OR referee_id IS NULL

status = success

#### <u>solutions</u>

a solution from leetcode

    SELECT name
    FROM Customer
    WHERE COALESCE(referee_id,0) <> 2;

#### <u>notes</u>

1. Not Equal Operators

!= and <> can both act as a "not equal" operator

2. COALESCE

The COALESCE function in MySQL is used to get the first non-null value from a list of expressions.

If all the values in the list are evaluated to NULL, then the COALESCE() function returns NULL. The COALESCE() function accepts one parameter, which is the list, which can contain various values

syntax:

    COALESCE(value_1, value_2, …., value_n)
    
* COALESCE() can be used to substitute NULL values in table columns with a default value or an expression.
* COALESCE() is more flexible than IFNULL() as it can handle any number of arguments, while IFNULL() only takes two arguments.

### 586. Customer Placing the Largest Number of Orders

#### <u>description</u>

Table: Orders

    +-----------------+----------+
    | Column Name     | Type     |
    +-----------------+----------+
    | order_number    | int      |
    | customer_number | int      |
    +-----------------+----------+
order_number is the primary key (column with unique values) for this table.
This table contains information about the order ID and the customer ID.
 

Write a solution to find the customer_number for the customer who has placed the largest number of orders.

The test cases are generated so that exactly one customer will have placed more orders than any other customer.

#### <u>attempts</u>

NOTE: this query gives the right customer_number but comes with an additional unwanted column "c", however i can visualize what's happening

    SELECT customer_number, COUNT(order_number) as c
    FROM Orders
    GROUP BY customer_number
    ORDER BY c DESC LIMIT 1

status = failure

NOTE: really not entirely sure why this works i.e hard time visualizing what the GROUP BY and ORDER BY does (also didn't know i could use COUNT with the ORDER BY clause). it's also really efficient apparently

    SELECT customer_number
    FROM Orders
    GROUP BY customer_number
    ORDER BY COUNT(customer_number) DESC LIMIT 1

status = success

#### <u>solutions</u>

from some leetcode solution; almost identical to mine bu the COUNT() is different

    SELECT customer_number
    FROM orders
    GROUP BY customer_number
    ORDER BY COUNT(*) DESC
    LIMIT 1;

#### <u>notes</u>

most solutions has the same answer as me, this is the explanation from one of the solution:

1. Grouping the orders by customer_number.
2. Counting the number of orders for each customer_number.
3. Ordering the results by the count of orders in descending order.
4. Limiting the output to only the first row, which will contain the customer_number with the highest count of orders.

### 595. Big Countries

#### <u>description</u>

Table: World

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | name        | varchar |
    | continent   | varchar |
    | area        | int     |
    | population  | int     |
    | gdp         | bigint  |
    +-------------+---------+
    
name is the primary key (column with unique values) for this table.
Each row of this table gives information about the name of a country, the continent to which it belongs, its area, the population, and its GDP value.
 

A country is big if:

it has an area of at least three million (i.e., 3000000 km2), or
it has a population of at least twenty-five million (i.e., 25000000).
Write a solution to find the name, population, and area of the big countries.

Return the result table in any order.

#### <u>attempts</u>

    SELECT name, population, area FROM World
    WHERE area >= 3000000 OR population >=  25000000

status = success

#### <u>solutions</u>

#### <u>notes</u>

this problem is extremely straightforward

### 596. Classes More than 5 Students

#### <u>description</u>

Table: Courses

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | student     | varchar |
    | class       | varchar |
    +-------------+---------+
(student, class) is the primary key (combination of columns with unique values) for this table.
Each row of this table indicates the name of a student and the class in which they are enrolled.
 

Write a solution to find all the classes that have at least five students.

Return the result table in any order.

#### <u>attempts</u>

    SELECT class FROM Courses
    GROUP BY class
    HAVING COUNT(class) >= 5

status = success

#### <u>solutions</u>

this also works, perhaps a bit more intuitive

    SELECT class FROM Courses
    GROUP BY class
    HAVING COUNT(student) >= 5

#### <u>notes</u>

another extremely straightforward problem

### 607. Sales Person

#### <u>description</u>

Table: SalesPerson

    +-----------------+---------+
    | Column Name     | Type    |
    +-----------------+---------+
    | sales_id        | int     |
    | name            | varchar |
    | salary          | int     |
    | commission_rate | int     |
    | hire_date       | date    |
    +-----------------+---------+
sales_id is the primary key (column with unique values) for this table.
Each row of this table indicates the name and the ID of a salesperson alongside their salary, commission rate, and hire date.
 

Table: Company

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | com_id      | int     |
    | name        | varchar |
    | city        | varchar |
    +-------------+---------+
com_id is the primary key (column with unique values) for this table.
Each row of this table indicates the name and the ID of a company and the city in which the company is located.
 

Table: Orders

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | order_id    | int  |
    | order_date  | date |
    | com_id      | int  |
    | sales_id    | int  |
    | amount      | int  |
    +-------------+------+
order_id is the primary key (column with unique values) for this table.
com_id is a foreign key (reference column) to com_id from the Company table.
sales_id is a foreign key (reference column) to sales_id from the SalesPerson table.
Each row of this table contains information about one order. This includes the ID of the company, the ID of the salesperson, the date of the order, and the amount paid.
 

Write a solution to find the names of all the salespersons who did not have any orders related to the company with the name "RED".

Return the result table in any order.

#### <u>attempts</u>

NOTE: this really feels like it should work but the output is plain wrong

    SELECT sales.name FROM SalesPerson sales
    JOIN Orders orders ON orders.sales_id = sales.sales_id
    JOIN Company company ON orders.com_id = company.com_id
    WHERE company.name <> "RED"
    
status = failure

NOTE: above was definitely incorrect, below works

    SELECT name FROM SalesPerson
    WHERE sales_id NOT IN (
        SELECT sales.sales_id FROM Orders orders
        JOIN Company company ON orders.com_id = company.com_id
        JOIN SalesPerson sales ON orders.sales_id = sales.sales_id
        WHERE company.name = "RED"
    )

status = success

#### <u>solutions</u>

#### <u>notes</u>

the solutions are all some variation of what i wrote, so nothing new to add. however i struggled a bit with this problem; i still seem to have a hard time visualizing the output tables after performing operations on them

### 610. Triangle Judgement

#### <u>description</u>

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | x           | int  |
    | y           | int  |
    | z           | int  |
    +-------------+------+
In SQL, (x, y, z) is the primary key column for this table.
Each row of this table contains the lengths of three line segments.

Report for every three line segments whether they can form a triangle.

Return the result table in any order.

#### <u>attempts</u>

didn't really bother with this one, didn't seem so much to be about SQL but rather geometry...

#### <u>solutions</u>

from some leetcode solution

    SELECT *, IF(x+y>z AND y+z>x AND z+x>y, "Yes", "No") as triangle
    FROM Triangle

#### <u>notes</u>

new function used here, IF()

1. IF

The IF() function returns a value if a condition is TRUE, or another value if a condition is FALSE.

syntax:

    IF(condition, value_if_true, value_if_false)

### 619. Biggest Single Number

#### <u>description</u>

Table: MyNumbers

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | num         | int  |
    +-------------+------+
This table may contain duplicates (In other words, there is no primary key for this table in SQL).
Each row of this table contains an integer.
 

A single number is a number that appeared only once in the MyNumbers table.

Find the largest single number. If there is no single number, report null.

#### <u>attempts</u>

    SELECT MAX(num) AS num FROM (
        SELECT * FROM MyNumbers
        GROUP BY num
        HAVING COUNT(num) = 1
    ) AS sub

status = success

#### <u>solutions</u>

solution from a leetcode thread, uses sorting instead of subquery

    SELECT IF(COUNT(num) =1, num, null) AS num          # if the number appears exactly once, it is returned, otherwise null is returned
    FROM MyNumbers 
    GROUP BY num                                        # groups the rows by the 'num' column. each group contains all rows with the same 'num' value
    ORDER BY COUNT(num), num DESC                       # this clause sorts results first by the count of each 'num' in asc order, then by 'num in desc order
                                                        # ensures that 1. numbers that appear once are at the top, 2. among those, the largest numbers appears first
    LIMIT 1;                                            # picks the top number 
    
NOTE: not as fast apparently. also a bit confusing since the original column and the new one are both named num, i assume the group and order is done on the new column. also not entirely sure if GPT's explanation is correct or if there is something about sql's order of operation i still don't fundamentally understand...

explanation: The query groups the table by each number, counts the occurrences, and uses the IF function to either select the number (if it appears exactly once) or null. It then sorts the results such that numbers that appear exactly once are prioritized and, among those, the largest number comes first. Finally, it selects the top result.

#### <u>notes</u>

initially wrote 

    SELECT MAX(num) AS num FROM (
        SELECT * FROM MyNumbers
        GROUP BY num
        HAVING COUNT(num) = 1
    )

but this query failed. the subquery (derived table) in this case must have a name, hence the AS sub (simply putting sub next to the ending paranthesis also works)

i also initialy though that my corrected query wouldn't work, that i had to write a condition in the event that there were no single numbers but that is not the case. SELECT will return null if the subquery is empty due to there being no single numbers

### 620. Not Boring Movies

#### <u>description</u>

Table: Cinema

    +----------------+----------+
    | Column Name    | Type     |
    +----------------+----------+
    | id             | int      |
    | movie          | varchar  |
    | description    | varchar  |
    | rating         | float    |
    +----------------+----------+
id is the primary key (column with unique values) for this table.
Each row contains information about the name of a movie, its genre, and its rating.
rating is a 2 decimal places float in the range [0, 10]
 

Write a solution to report the movies with an odd-numbered ID and a description that is not "boring".

Return the result table ordered by rating in descending order.

#### <u>attempts</u>

    SELECT * FROM Cinema
    WHERE MOD(id,2)=1 AND description <> 'boring'
    ORDER BY rating DESC

status = success

#### <u>solutions</u>

just about every top solutions are the exact same as my query

#### <u>notes</u>

in the WHERE clause in my attempt, it is possible to use the modulus operator instead of the function as well. so writing this also works:

    WHERE id % 2 = 1 AND description <> 'boring'

### 627. Swap Salary

#### <u>description</u>

Table: Salary

    +-------------+----------+
    | Column Name | Type     |
    +-------------+----------+
    | id          | int      |
    | name        | varchar  |
    | sex         | ENUM     |
    | salary      | int      |
    +-------------+----------+
id is the primary key (column with unique values) for this table.
The sex column is ENUM (category) value of type ('m', 'f').
The table contains information about an employee.
 

Write a solution to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

#### <u>attempts</u>

NOTE: slow solution

    UPDATE Salary
    SET sex = CASE WHEN sex = 'm' THEN 'f' ELSE 'm' END;
    
status = success

#### <u>solutions</u>

some solution from leetcode. similar to mine but appears faster and more 'precise'. all the others were very similar to mine. there is a slight change in the syntax that would be worth looking into

    Update Salary
    SET sex= CASE sex
    WHEN 'm' THEN 'f'
    WHEN 'f' THEN 'm'
    ELSE sex
    END

#### <u>notes</u>

this is the template i used to create my solution, it's possible to update multiple columns at once:

    UPDATE myTable
    SET 
    col1 = CASE WHEN col1 = 1 THEN 5 ELSE 1 END,
    col2 = CASE WHEN col2 = 2 THEN 6 ELSE 2 END,
    col3 = CASE WHEN col3 = 3 THEN 7 ELSE 3 END

### 1050. Actors and Directors Who Cooperated At Least Three Times

#### <u>description</u>

Table: ActorDirector

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | actor_id    | int     |
    | director_id | int     |
    | timestamp   | int     |
    +-------------+---------+
timestamp is the primary key (column with unique values) for this table.
 

Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.

Return the result table in any order.

#### <u>attempts</u>

NOTE: this won't work because every time actor_id >=3 the second condition will be met too, logical flaw  
  
    SELECT actor_id, director_id
    FROM ActorDirector
    GROUP BY actor_id
    HAVING COUNT(actor_id) >= 3 AND COUNT(director_id) >= 3
    
status = failure

NOTE: the AND condition here isn't necessary, and simply HAVING COUNT(actor_id) >= 3 would suffice

    SELECT actor_id, director_id
    FROM ActorDirector
    GROUP BY actor_id, director_id
    HAVING COUNT(actor_id) >= 3 AND COUNT(director_id) >= 3
    
status = success

#### <u>solutions</u>

a leetcode solution

    SELECT actor_id, director_id 
    FROM (
    SELECT actor_id,director_id, 
    COUNT(timestamp) AS cooperated 
    FROM ActorDirector 
    GROUP BY actor_id,director_id) 
    table1
    WHERE cooperated>=3;

#### <u>notes</u>

there is still something about aggregations i still don't fundamentally understanding:
1. COUNT(), SUM(), etc. before the grouping
2. GROUP BY itself
3. aggregations performed after the grouping - HAVING COUNT(), SUM(), etc.

explanation of the leetcode solution:
the inner query here is the bulk of the solution. here's a breakdown
1. SELECT actor_id, director_id, COUNT(timestamp) AS cooperated
   * this part selects actor_id and director_id and counts the number of rows for each combination of actor_id and director_id. this count is given the alias 'cooperated'
2. GROUP BY actor_id, director_id
    * this groups the results by actor_id and director_id. for each unique combination of actor_id and director_id, it aggregates (counts) the number of timestamps (cooperations)
3. this is what the output would look like

        +-------------+-------------+------------+
        | actor_id    | director_id | cooperated |
        +-------------+-------------+------------+
        | 1           | 101         | 3          |
        | 1           | 102         | 2          |
        | 2           | 101         | 3          |
        +-------------+-------------+------------+
4. from there it is easy to see what the outer query does

### 1068. Product Sales Analysis I

#### <u>description</u>

Table: Sales

    +-------------+-------+
    | Column Name | Type  |
    +-------------+-------+
    | sale_id     | int   |
    | product_id  | int   |
    | year        | int   |
    | quantity    | int   |
    | price       | int   |
    +-------------+-------+
(sale_id, year) is the primary key (combination of columns with unique values) of this table.
product_id is a foreign key (reference column) to Product table.
Each row of this table shows a sale on the product product_id in a certain year.
Note that the price is per unit.
 

Table: Product

    +--------------+---------+
    | Column Name  | Type    |
    +--------------+---------+
    | product_id   | int     |
    | product_name | varchar |
    +--------------+---------+
product_id is the primary key (column with unique values) of this table.
Each row of this table indicates the product name of each product.
 

Write a solution to report the product_name, year, and price for each sale_id in the Sales table.

Return the resulting table in any order.

#### <u>attempts</u>

    SELECT p.product_name, s.year, s.price FROM Sales s
    JOIN Product p ON s.product_id = p.product_id
    
status = success

NOTE: also works since both tables have the same column for product_id

    SELECT product_name, year, price FROM Sales 
    JOIN Product USING(product_id)
    
status = success

#### <u>solutions</u>

very simple problem, solutions are all the same

#### <u>notes</u>

nothing to add

### 1075. Project Employees I

#### <u>description</u>

Table: Project

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | project_id  | int     |
    | employee_id | int     |
    +-------------+---------+
(project_id, employee_id) is the primary key of this table.
employee_id is a foreign key to Employee table.
Each row of this table indicates that the employee with employee_id is working on the project with project_id.
 

Table: Employee

    +------------------+---------+
    | Column Name      | Type    |
    +------------------+---------+
    | employee_id      | int     |
    | name             | varchar |
    | experience_years | int     |
    +------------------+---------+
employee_id is the primary key of this table. It's guaranteed that experience_years is not NULL.
Each row of this table contains information about one employee.
 

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

#### <u>attempts</u>

    SELECT project_id, ROUND(AVG(experience_years), 2) AS average_years
    FROM Project
    JOIN Employee USING(employee_id)
    GROUP BY project_id

status = success

#### <u>solutions</u>

another simple problem, solutions are all a variation of the same thing

#### <u>notes</u>

nothing to add

### 1084. Sales Analysis III

#### <u>description</u>

Table: Product

    +--------------+---------+
    | Column Name  | Type    |
    +--------------+---------+
    | product_id   | int     |
    | product_name | varchar |
    | unit_price   | int     |
    +--------------+---------+
product_id is the primary key (column with unique values) of this table.
Each row of this table indicates the name and the price of each product.
Table: Sales

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | seller_id   | int     |
    | product_id  | int     |
    | buyer_id    | int     |
    | sale_date   | date    |
    | quantity    | int     |
    | price       | int     |
    +-------------+---------+
This table can have duplicate rows.
product_id is a foreign key (reference column) to the Product table.
Each row of this table contains some information about one sale.
 

Write a solution to report the products that were only sold in the first quarter of 2019. That is, between 2019-01-01 and 2019-03-31 inclusive.

Return the result table in any order.

#### <u>attempts</u>

NOTE: this will not exclude products that are sold outside of this range as well. they need to be sold ONLY within this range

    SELECT product_id, product_name FROM Product
    JOIN Sales USING(product_id)
    WHERE sale_date BETWEEN '2019-01-01' AND '2019-03-31'

status = failure

NOTE: if a product_id exists in the Product table but not the Sales table, the output will not be correct

    SELECT product_id, product_name FROM Product
    WHERE product_id NOT IN
    (
        SELECT product_id FROM Product
        JOIN Sales USING(product_id)
        WHERE sale_date NOT BETWEEN '2019-01-01' AND '2019-03-31'
    ) 
    
status = failure

NOTE: using LEFT JOIN as opposed to RIGHT JOIN made the difference between success and failure. still having bit of a hard time to visualize left vs right join (although 
straightforward...). i believe the 'left' table is the first one mentioned (right after the FROM clause) and the right on is the one being joined. makes sense for this example

NOTE: also for whatever reason, putting the NOT BETWEEN statement in parantheses caused a syntax error -> s.sale_date (NOT BETWEEN '2019-01-01' AND '2019-03-31') <- doesn't work

    SELECT product_id, product_name FROM Product
    WHERE product_id NOT IN
    (
        SELECT p.product_id FROM Product p
        LEFT JOIN Sales s ON s.product_id = p.product_id
        WHERE s.sale_date IS NULL 
        OR s.sale_date NOT BETWEEN '2019-01-01' AND '2019-03-31'
    ) 
    
this also works

    SELECT product_id, product_name FROM Product
    WHERE product_id NOT IN
    (
        SELECT product_id FROM Product 
        LEFT JOIN Sales USING(product_id)
        WHERE sale_date IS NULL 
        OR sale_date NOT BETWEEN '2019-01-01' AND '2019-03-31'
    ) 
    
status = success

#### <u>solutions</u>

from some leetcode solution. this solution uses a GROUP BY and HAVING conditions to exclude those products that are sold both inside and outside the range, and doesn't need to deal with the null values

    SELECT s.product_id, product_name
    FROM Sales s
    LEFT JOIN Product p ON s.product_id = p.product_id
    GROUP BY s.product_id
    HAVING MIN(sale_date) >= '2019-01-01' AND MAX(sale_date) <= '2019-03-31'

#### <u>notes</u>

the BETWEEN operator:
* The BETWEEN operator selects values within a given range. The values can be numbers, text, or dates.
* The BETWEEN operator is inclusive: begin and end values are included. 
* NOT can be included before to give the opposite result

### 1141. User Activity for the Past 30 days I

#### <u>description</u>

Table: Activity

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | user_id       | int     |
    | session_id    | int     |
    | activity_date | date    |
    | activity_type | enum    |
    +---------------+---------+
This table may have duplicate rows.
The activity_type column is an ENUM (category) of type ('open_session', 'end_session', 'scroll_down', 'send_message').
The table shows the user activities for a social media website. 
Note that each session belongs to exactly one user.
 

Write a solution to find the daily active user count for a period of 30 days ending 2019-07-27 inclusively. A user was active on someday if they made at least one activity on that day.

Return the result table in any order.

#### <u>attempts</u>

NOTE: does not pass all test cases, not sure why... looking at the expected output, my first date is 1 day earlier than the expected result's earliest date. inclusivity error?

    SELECT activity_date AS day, COUNT(DISTINCT(user_id)) AS active_users
    FROM Activity
    WHERE activity_date BETWEEN DATE_SUB('2019-07-27', INTERVAL 30 DAY) AND '2019-07-27'
    GROUP BY activity_date

status = failure

NOTE: was just slightly off on my interval...

    SELECT activity_date AS day, COUNT(DISTINCT(user_id)) AS active_users
    FROM Activity
    WHERE activity_date BETWEEN DATE_SUB('2019-07-27', INTERVAL 29 DAY) AND '2019-07-27'
    GROUP BY activity_date
    
status = success

#### <u>solutions</u>

modified some leetcode solution. pretty similar to mine but uses HAVING instead of a WHERE clause

    SELECT activity_date AS day, COUNT(DISTINCT user_id) AS active_users
    FROM activity
    GROUP BY activity_date
    HAVING activity_date BETWEEN DATE_SUB('2019-07-27', INTERVAL 29 DAY) AND '2019-07-27'

#### <u>notes</u>

used DATE_SUB again, but below is a list of all the date functions (would be useful to get familiar with some of them: DATE_ADD, for example, does the opposite of DATE_SUB):

https://dev.mysql.com/doc/refman/8.4/en/date-and-time-functions.html#function_date-add

COUNT(DISTINCT(column_name)) is new to me. works pretty intuitively: the count only increments when a new user_id is encountered (in my solution). here's where it might be useful:
* This helps you understand the diversity and uniqueness of data.
* The COUNT(DISTINCT) identifies and eliminates duplicate values in your data. This is useful for data cleaning and ensuring data accuracy.
* COUNT(DISTINCT) helps in getting this count or categorical data, you might want to know the number of unique categories or options available.
* COUNT(DISTINCT) helps in generating the number of unique occurrences of certain attributes to get accurate and informative reports.
* You can analyze membership in various groups or categories by counting the number of distinct members in each group.
* COUNT(DISTINCT) provides unique value counts for analysis and decision-making

### 1148. Article Views I

#### <u>description</u>

Table: Views

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | article_id    | int     |
    | author_id     | int     |
    | viewer_id     | int     |
    | view_date     | date    |
    +---------------+---------+
There is no primary key (column with unique values) for this table, the table may have duplicate rows.
Each row of this table indicates that some viewer viewed an article (written by some author) on some date. 
Note that equal author_id and viewer_id indicate the same person.
 

Write a solution to find all the authors that viewed at least one of their own articles.

Return the result table sorted by id in ascending order.

#### <u>attempts</u>

    SELECT DISTINCT author_id as id 
    FROM Views
    WHERE author_id = viewer_id
    ORDER BY author_id

status = success

#### <u>solutions</u>

all the solutions are basically the same as mine

#### <u>notes</u>

nothing to add

### 1179. Reformat Department Table

#### <u>description</u>

Table: Department

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | revenue     | int     |
    | month       | varchar |
    +-------------+---------+
In SQL,(id, month) is the primary key of this table.
The table has information about the revenue of each department per month.
The month has values in ["Jan","Feb","Mar","Apr","May","Jun","Jul","Aug","Sep","Oct","Nov","Dec"].
 

Reformat the table such that there is a department id column and a revenue column for each month.

Return the result table in any order.

#### <u>attempts</u>

NOTE: first attempt i was just stumped... was looking into DECLARE to create some kind of date range and then looking into iterating through it while looking at the Department table to generate the columns, but then gave up on that when it looked like too much for an easy problem

    DECLARE @StartDate date = 

    UPDATE Department
    
status = failure

NOTE: foolishly tried to use a stackoverflow response that was for SQL server (our queries are meant to use MySQL). SQL server uses square brackets instead of backticks to delimit identifier, so i changed those, only to find out MySQL does not have a PIVOT keyword

    SELECT id, `Jan`,`Feb`,`Mar`,`Apr`,`May`,`Jun`,`Jul`,`Aug`,`Sep`,`Oct`,`Nov`,`Dec`
    FROM Department
    PIVOT (revenue FOR month IN (`Jan`,`Feb`,`Mar`,`Apr`,`May`,`Jun`,`Jul`,`Aug`,`Sep`,`Oct`,`Nov`,`Dec`)
    ) pvt

status = failure

this is the query i tried copying:

    SELECT  Project, [Jan 2014], [Feb 2014], [Mar 2014], [April 2014]
    FROM    T
            PIVOT
            (   SUM(MonthValues)
                FOR Months IN ([Jan 2014], [Feb 2014], [Mar 2014], [April 2014])
            ) pvt;

NOTE: this works, but there HAS to be a smarter way (also doesn't matter if you use SUM or MAX)

    SELECT id,
    SUM(CASE WHEN month ='Jan' THEN revenue ELSE null END) AS Jan_Revenue,
    SUM(CASE WHEN month ='Feb' THEN revenue ELSE null END) AS Feb_Revenue,
    SUM(CASE WHEN month ='Mar' THEN revenue ELSE null END) AS Mar_Revenue,
    SUM(CASE WHEN month ='Apr' THEN revenue ELSE null END) AS Apr_Revenue,
    SUM(CASE WHEN month ='May' THEN revenue ELSE null END) AS May_Revenue,
    SUM(CASE WHEN month ='Jun' THEN revenue ELSE null END) AS Jun_Revenue,
    SUM(CASE WHEN month ='Jul' THEN revenue ELSE null END) AS Jul_Revenue,
    SUM(CASE WHEN month ='Aug' THEN revenue ELSE null END) AS Aug_Revenue,
    SUM(CASE WHEN month ='Sep' THEN revenue ELSE null END) AS Sep_Revenue,
    SUM(CASE WHEN month ='Oct' THEN revenue ELSE null END) AS Oct_Revenue,
    SUM(CASE WHEN month ='Nov' THEN revenue ELSE null END) AS Nov_Revenue,
    SUM(CASE WHEN month ='Dec' THEN revenue ELSE null END) AS Dec_Revenue
    FROM Department
    GROUP BY id

status = success

#### <u>solutions</u>

from some leetcode solution

    SELECT
    Id,
    SUM(IF(month = 'Jan', revenue, null)) AS Jan_Revenue,
    SUM(IF(month = 'Feb', revenue, null)) AS Feb_Revenue,
    SUM(IF(month = 'Mar', revenue, null)) AS Mar_Revenue,
    SUM(IF(month = 'Apr', revenue, null)) AS Apr_Revenue,
    SUM(IF(month = 'May', revenue, null)) AS May_Revenue,
    SUM(IF(month = 'Jun', revenue, null)) AS Jun_Revenue,
    SUM(IF(month = 'Jul', revenue, null)) AS Jul_Revenue,
    SUM(IF(month = 'Aug', revenue, null)) AS Aug_Revenue,
    SUM(IF(month = 'Sep', revenue, null)) AS Sep_Revenue,
    SUM(IF(month = 'Oct', revenue, null)) AS Oct_Revenue,
    SUM(IF(month = 'Nov', revenue, null)) AS Nov_Revenue,
    SUM(IF(month = 'Dec', revenue, null)) AS Dec_Revenue
    FROM Department
    GROUP BY id;

#### <u>notes</u>

haven't found a non-verbose way of solving this problem. also looking at my solution and one of the leetcode solution i found, hard to tell if it's more appropriate to use CASE WHEN or IF, or what really is the difference between the two in this case

### 1211. Queries Quality and Percentage

#### <u>description</u>

Table: Queries

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | query_name  | varchar |
    | result      | varchar |
    | position    | int     |
    | rating      | int     |
    +-------------+---------+
This table may have duplicate rows.
This table contains information collected from some queries on a database.
The position column has a value from 1 to 500.
The rating column has a value from 1 to 5. Query with rating less than 3 is a poor query.
 

We define query quality as:

The average of the ratio between query rating and its position.

We also define poor query percentage as:

The percentage of all queries with rating less than 3.

Write a solution to find each query_name, the quality and poor_query_percentage.

Both quality and poor_query_percentage should be rounded to 2 decimal places.

Return the result table in any order.

#### <u>attempts</u>

NOTE: can get the first two column but missing poor_query_percentage

    SELECT query_name, ROUND(AVG(rating / position), 2) AS quality
    FROM Queries
    GROUP BY query_name

    SELECT query_name, ROUND(AVG(rating / position), 2) AS quality, 
    ROUND(SUM(IF(rating < 3, 1 , 0))/COUNT(query_name)*100,2) AS poor_query_percentage
    FROM Queries
    WHERE query_name IS NOT null
    GROUP BY query_name
    
status = success

#### <u>solutions</u>

from some leetcode solution. for the most part the approach is the same as mine but with slightly different operations

    SELECT query_name, ROUND(AVG(CAST(rating AS decimal)/position), 2) AS quality,
    ROUND(SUM(CASE WHEN rating < 3 THEN 1 ELSE 0 end) * 100 / count(*), 2) AS poor_query_percentage
    FROM Queries
    GROUP BY query_name
    HAVING query_name IS NOT NULL

#### <u>notes</u>

for my solution, the part of the query that deals with poor_query_percentage is a bit confusing, here's my attempt to break it down:

1. IF(rating < 3, 1, 0) -> first off we only want to consider the bad queries, those below a rating of 3
2. SUM(IF(rating < 3, 1, 0)) -> then we want the sum of all those bad queries, essentially acting as a count of bad queries
3. SUM(IF(rating < 3, 1, 0))/COUNT(query_name)*100 -> this now calculates the percentage of bad queries, using the count calculated in step 2. and the total count of queries (i believe all this works because of the GROUP BY)
4. ROUND(SUM(IF(rating < 3, 1, 0))/COUNT(query_name)*100 , 2) AS poor_query_percentage -> last step just rounds to 2 decimal places as asked by the question

once again, unsure what the difference is between CASE and IF, seem to be operating the same. same thing for WHERE and HAVING, also seems to behaved the same. need to look into subtle differences, if there are any

CAST()
* the CAST() function converts a value (of any type) into a specified datatype
* syntax -> CAST(value AS datatype)

### 1251. Average Selling Price

#### <u>description</u>

Table: Prices

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | product_id    | int     |
    | start_date    | date    |
    | end_date      | date    |
    | price         | int     |
    +---------------+---------+
(product_id, start_date, end_date) is the primary key (combination of columns with unique values) for this table.
Each row of this table indicates the price of the product_id in the period from start_date to end_date.
For each product_id there will be no two overlapping periods. That means there will be no two intersecting periods for the same product_id.
 

Table: UnitsSold

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | product_id    | int     |
    | purchase_date | date    |
    | units         | int     |
    +---------------+---------+
This table may contain duplicate rows.
Each row of this table indicates the date, units, and product_id of each product sold. 
 

Write a solution to find the average selling price for each product. average_price should be rounded to 2 decimal places.

Return the result table in any order.

#### <u>attempts</u>

NOTE: very close to passing but misses an edge case where there is a product that exists in the Prices table but not in the UnitsSold table, in which case the average price should show up as 0 instead of not being there at all
 
     SELECT product_id, ROUND(SUM(sales)/SUM(units), 2) AS average_price FROM (
        SELECT u.product_id, (p.price * u.units) AS sales, u.units FROM Prices p
        JOIN UnitsSold u ON p.product_id = u.product_id 
        WHERE u.purchase_date BETWEEN p.start_date AND p.end_date
    ) s
    GROUP BY product_id
    
status = failure

    SELECT product_id, IF(units IS NOT NULL, ROUND(SUM(sales)/SUM(units), 2), 0) AS average_price FROM (
        SELECT p.product_id, (p.price * u.units) AS sales, u.units FROM Prices p
        LEFT JOIN UnitsSold u ON p.product_id = u.product_id 
        WHERE u.purchase_date BETWEEN p.start_date AND p.end_date OR u.units IS NULL
    ) s
    GROUP BY product_id
    
status = success

#### <u>solutions</u>

from a leetcode solution. seems to use the same idea as me but there is no subquery used because of two important things: 1. the sales are directly calculated in the average_price calculation 2. the join is made using product_id like i did but it uses an additional condition (which i didn't know you could use with ON) similar to my WHERE clause to preserve ranges that are logical.

i am not sure how the IFNULL() works but this with the LEFT JOIN seem to have similar application as my solution with the u.units IS NULL + IF(units IS NOT NULL...) 

    SELECT p.product_id, IFNULL(ROUND(SUM(p.price*u.units)/SUM(u.units),2),0) AS average_price
    FROM Prices p 
    LEFT JOIN UnitsSold u
    ON p.product_id = u.product_id AND 
    u.purchase_date BETWEEN p.Start_date and p.end_date
    GROUP BY p.product_id

#### <u>notes</u>

explanation for the query in my attempt that succeeded...

1. the subquery. in the subquery, the goal is to get a table with the sales made by each product for a given range (mutiplying the price by the units sold) as well as getting the product_id and the units which will be important for the outer query. the ranges are preserved as they should be using the WHERE clause and the BETWEEN operator (the output table is nonsensical without, and it is likely this query can be improved). it is important to also include the case where the units would be null (in the case that the product exists in the Product table but not in the UnitsSold table) in order to cover the egde case. 
2. outer query. now that you have the product_id, sales, and units for each range you can now perform the necessary operation to get the average_price. here's a breakdown of how it is done:
    * ROUND(SUM(sales)/SUM(units), 2) -> this line, leveraging the GROUP BY, calculates the sum of sales and divides it by the sum of units to find the average price for a given product. this works because neither sales or units were agreggated earlier, only the sales made for those units within a certain range was calculated. the answer is also rounded since the question asks for it
    * IF(units IS NOT NULL, ROUND(SUM(sales)/SUM(units), 2) 0) -> the previous calculation is wrapped by an IF function. this is why it was important to include the OR statement in the WHERE clause in the subquery. if the units are not null, the operation is performed. otherwise, 0 is simply returned
    * GROUP BY product_id -> this is included so that the aggregations are performed correctly and the proper average price per product can be returned

### 1280. Students and Examination*

#### <u>description</u>

Table: Students

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | student_id    | int     |
    | student_name  | varchar |
    +---------------+---------+
student_id is the primary key (column with unique values) for this table.
Each row of this table contains the ID and the name of one student in the school.
 

Table: Subjects

    +--------------+---------+
    | Column Name  | Type    |
    +--------------+---------+
    | subject_name | varchar |
    +--------------+---------+
subject_name is the primary key (column with unique values) for this table.
Each row of this table contains the name of one subject in the school.
 

Table: Examinations

    +--------------+---------+
    | Column Name  | Type    |
    +--------------+---------+
    | student_id   | int     |
    | subject_name | varchar |
    +--------------+---------+
There is no primary key (column with unique values) for this table. It may contain duplicates.
Each student from the Students table takes every course from the Subjects table.
Each row of this table indicates that a student with ID student_id attended the exam of subject_name.
 

Write a solution to find the number of times each student attended each exam.

Return the result table ordered by student_id and subject_name.

#### <u>attempts</u>

NOTE: appears i was missing some tools to complete this problem - did not look really feasible without CROSS JOIN

status = failure

#### <u>solutions</u>

there is a lot of variation in the answers unlike other problems, but most makes use of the CROSS JOIN operator. from a leetcode solution. makes use of the CROSS JOIN operator which creates a cartesian product, a LEFT JOIN, and uses a variety of grouping...

    SELECT stu.student_id, stu.student_name, sub.subject_name, COUNT(exam.subject_name) AS attended_exams
    FROM Students AS stu
    CROSS JOIN Subjects AS sub
    LEFT JOIN Examinations AS exam
    ON exam.student_id = stu.student_id AND sub.subject_name = exam.subject_name
    GROUP BY
    stu.student_id, stu.student_name, sub.subject_name
    ORDER BY
    stu.student_id, sub.subject_name;

#### <u>notes</u>

explanation of the solution:

* Cross Join: Combines every student with every subject, creating a list of all possible student-subject pairs.
* Left Join: Connects this list with the Examinations table to find which students have taken exams in which subjects.
* Grouping: Groups the results by student, subject, and counts the number of exams attended for each combination.
* Ordering: Sorts the results by student_id and then by subject_name for better readability.

REVIEW & REVISE THIS: from my understanding you need to start with the Students table to have all the names (Alex does not take any exam but still needs to show 0 participation in each subject), followed by the CROSS JOIN with the subjects to create the cartesian product table, lastly joining the Examinations table to get the count. at this time not entirely sure how/why the GROUP BY works here

### 1327. List the Products Ordered in a Period

#### <u>description</u>

Table: Products

    +------------------+---------+
    | Column Name      | Type    |
    +------------------+---------+
    | product_id       | int     |
    | product_name     | varchar |
    | product_category | varchar |
    +------------------+---------+
product_id is the primary key (column with unique values) for this table.
This table contains data about the company's products.
 

Table: Orders

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | product_id    | int     |
    | order_date    | date    |
    | unit          | int     |
    +---------------+---------+
This table may have duplicate rows.
product_id is a foreign key (reference column) to the Products table.
unit is the number of products ordered in order_date.
 

Write a solution to get the names of products that have at least 100 units ordered in February 2020 and their amount.

Return the result table in any order.

#### <u>attempts</u>

NOTE: a bit confusing how the SUM() alias is also named unit (as requested from the question), what does the HAVING clause look at later on? original unit from the table or the SUM(unit) AS unit defined earlier? likely the latter otherwise this wouldn't work. tested and it's definitely the latter, the original unit column is not even recognized if i changed the aggregation alias to units instead

    SELECT product_name, SUM(unit) AS unit FROM Orders 
    JOIN Products USING(product_id)
    WHERE MONTH(order_date) = 2 AND YEAR(order_date) = 2020 
    GROUP BY product_id
    HAVING unit >= 100
    
status = success

#### <u>solutions</u>

all the solutions appear very similar to mine

#### <u>notes</u>

* in my attempt, made use of new date functions. MONTH() which extracts the month from a date in numerical format, and YEAR() which does the same for the year
* at this time, a little unsure why the HAVING unit >= 100 is necessary. originally added another condition in the WHERE clause of unit >= 100 but that didn't work. i believe that the WHERE conditions is applied before the aggregation and therefore for each row, which is why it didn't work and we need to use HAVING, which is applied after the aggregation

### 1378. Replace Employee ID with Unique the Identifier

#### <u>description</u>

Table: Employees

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | id            | int     |
    | name          | varchar |
    +---------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table contains the id and the name of an employee in a company.
 

Table: EmployeeUNI

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | id            | int     |
    | unique_id     | int     |
    +---------------+---------+
(id, unique_id) is the primary key (combination of columns with unique values) for this table.
Each row of this table contains the id and the corresponding unique id of an employee in the company.
 

Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

Return the result table in any order.

#### <u>attempts</u>

    SELECT unique_id, name FROM Employees
    LEFT JOIN EmployeeUNI USING(id)
    
status = success

#### <u>solutions</u>

all are fairly similar to my solution

#### <u>notes</u>

nothing to add - fairly straightforward problem

### 1407. Top Travellers

#### <u>description</u>

Table: Users

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | id            | int     |
    | name          | varchar |
    +---------------+---------+
id is the column with unique values for this table.
name is the name of the user.
 

Table: Rides

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | id            | int     |
    | user_id       | int     |
    | distance      | int     |
    +---------------+---------+
id is the column with unique values for this table.
user_id is the id of the user who traveled the distance "distance".
 

Write a solution to report the distance traveled by each user.

Return the result table ordered by travelled_distance in descending order, if two or more users traveled the same distance, order them by their name in ascending order.

#### <u>attempts</u>

    SELECT u.name, IFNULL(SUM(r.distance), 0) AS travelled_distance
    FROM Users u
    LEFT JOIN Rides r ON u.id = r.user_id
    GROUP BY u.id
    ORDER BY travelled_distance DESC, u.name
    
status = success

#### <u>solutions</u>

a solution from leetcode. somewhat similar to mine but uses CASE WHEN and OVER(), which i have used before but am not 100% confident in using

    SELECT DISTINCT u.name, 
    CASE WHEN r.distance IS NOT NULL THEN SUM(r.distance) OVER(PARTITION BY r.user_id ORDER BY r.user_id) 
    ELSE 0 END AS travelled_distance 
    FROM Users u 
    LEFT JOIN Rides r ON u.id=r.user_id 
    ORDER BY travelled_distance DESC, u.name

#### <u>notes</u>

in my attempt, important to GROUP BY u.id and not u.name, because if you have two users with the same name but different id you do not pass all the test cases. LEFT JOIN is also important because for some reason if you have a user with an id but no travel distance, it must display 0 travelled_distance in the output table (which is why I used the IFNULL() also)

    new function: IFNULL()

    description: Return the specified value IF the expression is NULL, otherwise return the expression

    syntax: IFNULL(expression, alt_value)

### 1484. Group Sold Products by the Date

#### <u>description</u>

Table Activities:

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | sell_date   | date    |
    | product     | varchar |
    +-------------+---------+
There is no primary key (column with unique values) for this table. It may contain duplicates.
Each row of this table contains the product name and the date it was sold in a market.
 

Write a solution to find for each date the number of different products sold and their names.

The sold products names for each date should be sorted lexicographically.

Return the result table ordered by sell_date.

#### <u>attempts</u>


    SELECT sell_date, COUNT(DISTINCT(product)) AS num_sold, GROUP_CONCAT(DISTINCT(product) ORDER BY product) AS products
    FROM Activities
    GROUP BY sell_date
    ORDER BY sell_date
    
status = success

#### <u>solutions</u>

most solutions are similar to mine, but they have an extra "argument" to their GROUP_CONCAT that allows for extra control of the output, which is the SEPERATOR argument


    SELECT sell_date, COUNT(DISTINCT(product)) AS num_sold, GROUP_CONCAT(DISTINCT(product) ORDER BY product SEPARATOR ',') AS products
    FROM Activities
    GROUP BY sell_date
    ORDER BY sell_date

#### <u>notes</u>

1. the secret sauce for this problem is GROUP_CONCAT which allows you to use a CONCAT() function with a GROUP BY, essentially. 

* syntax:

        GROUP_CONCAT(expr 
                [ORDER BY {unsigned_integer | col_name | expr} ASC | DESC] 
                [SEPARATOR str_val])

2. the only real hic up in this problem is that both the COUNT for the num_sold column and the GROUP_CONCAT for the products column need to grab distinct products (so you only want to know the number of different product solds, not the number of total product sold)

### 1517. Find Users with Valid E-mails

#### <u>description</u>

Table: Users

    +---------------+---------+
    | Column Name   | Type    |
    +---------------+---------+
    | user_id       | int     |
    | name          | varchar |
    | mail          | varchar |
    +---------------+---------+
user_id is the primary key (column with unique values) for this table.
This table contains information of the users signed up in a website. Some e-mails are invalid.
 

Write a solution to find the users who have valid emails.

A valid e-mail has a prefix name and a domain where:

The prefix name is a string that may contain letters (upper or lower case), digits, underscore '_', period '.', and/or dash '-'. The prefix name must start with a letter.
The domain is '@leetcode.com'.
Return the result table in any order.

#### <u>attempts</u>

NOTE: for some reason without the additional condition LOCATE('?', mail) = 0 a test case would fail where the domain is @leetcode?com -> is the ? and . considered the same in the regex?

    SELECT user_id, name, mail
    FROM Users
    WHERE mail REGEXP '^[a-zA-Z][a-zA-Z0-9._-]*@leetcode\.com$' AND LOCATE('?', mail) = 0
    
status = success

NOTE: the addition of another backslash in the domain part of the regex fixes the issue. i consider this the best answer
    
    SELECT user_id, name, mail
    FROM Users
    WHERE mail REGEXP '^[a-zA-Z][a-zA-Z0-9._-]*@leetcode\\.com$'
    
    
status = success

#### <u>solutions</u>

this leetcode solution uses a different pattern. really confused as to why this one works because the (\\\\?com)?\\\\.com makes the ?com optional meaning you can match both @leetcode?com AND @leetcode.com 

    SELECT user_id, name, mail
    FROM Users
    WHERE mail REGEXP '^[A-Za-z][A-Za-z0-9_\.\-]*@leetcode(\\?com)?\\.com$'

#### <u>notes</u>

1. here is the explanation for the regex expression used in my attempt:

* ^ - Ensures the match starts at the beginning of the string.
* [a-zA-Z] - The string must start with an uppercase or lowercase letter.
* [a-zA-Z0-9._-]* - Allows zero or more letters (uppercase or lowercase), digits, underscores, periods, or dashes.
* @leetcode\\.com - Specifies that the string ends with @leetcode.com. (Note: . is escaped with \ to match a literal period. Note2: an additonal backslash is accually required for MySQL, as seen in the second attempt)
* $ - Ensures the match ends at the end of the string.

2. new function: LOCATE()    <--- **also the way this is formatted should be the gold standard when introducing new functions**

* definition:
           
        The LOCATE() function returns the position of the first occurrence of a substring in a string.

        If the substring is not found within the original string, this function returns 0.

        This function performs a case-insensitive search.

        Note: This function is equal to the POSITION() function.
        
* syntax: 
        
        LOCATE(substring, string, start)
        
* parameter values


        substring  Required. The substring to search for in string
        string     Required. The string that will be searched
        start      Optional. The starting position for the search. Position 1 is default

## Medium Problems

### 176. Second Highest Salary

#### <u>description</u>

Table: Employee

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | id          | int  |
    | salary      | int  |
    +-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the second highest salary from the Employee table. If there is no second highest salary, return null (return None in Pandas).

#### <u>attempts</u>

NOTE: works only if there is a second highest. otherwise it's supposed to return null but doesn't

    SELECT salary AS secondHighestSalary FROM Employee
    ORDER BY salary DESC
    LIMIT 1, 1
    
status = failure

NOTE: thought there might be some trick i don't know, so looked up the query on google to select second highest salary... solution is super simple

    SELECT MAX(salary) as secondHighestSalary FROM Employee
    WHERE salary NOT IN (
        SELECT MAX(salary)
        FROM Employee
    )
    
status = success

#### <u>solutions</u>

from some leetcode solution. used the offset like in my initial attempt but added additional logic to satisfy the null condition

    SELECT
        (SELECT DISTINCT salary 
        FROM Employee 
        ORDER BY salary DESC 
        LIMIT 1 OFFSET 1) AS SecondHighestSalary;

#### <u>notes</u>

first medium SQL problem. there were no new keywords, functions or tools here, just using a combination of things and getting creative. as seen by the attempts and the solutions, there's multiple ways of getting to the solution. gave up a little too quickly on this one, will need to develop my problem solving in SQL, even if initially my code is ugly or slow. also got intimidated by the fact that the problem only had a 40% acceptance rate, should ignore those numbers and just focus on solving the problem

### 177. Nth Highest Salary@ <- uses custom SQL functions i haven't seen before; come back to it later

#### <u>description</u>

Table: Employee

    +-------------+------+
    | Column Name | Type |
    +-------------+------+
    | id          | int  |
    | salary      | int  |
    +-------------+------+
id is the primary key (column with unique values) for this table.
Each row of this table contains information about the salary of an employee.
 

Write a solution to find the nth highest salary from the Employee table. If there is no nth highest salary, return null.

#### <u>attempts</u>

    -CREATE FUNCTION getNthHighestSalary(N INT) RETURNS INT
    -BEGIN
    -  RETURN (
    -      # Write your MySQL query statement below.
    -
    -  );
    -END

#### <u>solutions</u>

#### <u>notes</u>

### 178. Rank Scores

#### <u>description</u>

Table: Scores

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | score       | decimal |
    +-------------+---------+
id is the primary key (column with unique values) for this table.
Each row of this table contains the score of a game. Score is a floating point value with two decimal places.
 

Write a solution to find the rank of the scores. The ranking should be calculated according to the following rules:

* The scores should be ranked from the highest to the lowest.
* If there is a tie between two scores, both should have the same ranking.
* After a tie, the next ranking number should be the next consecutive integer value. In other words, there should be no holes between ranks.

Return the result table ordered by score in descending order.

#### <u>attempts</u>

NOTE: this fails because the RANK() function here will give the same rank value to tied score, but will increment either way. in other words, if the two top score are 4.0, they will both rank as 1, but if the next following top score is 3.85, it will rank as 3 (as opposed to 2 as specified by the question)

    SELECT score, RANK() OVER(ORDER BY score DESC) AS 'rank'
    FROM Scores
    
status = failure

#### <u>solutions</u>

NOTE: DENSE_RANK() fixes the issue by not allowing gaps between rankings

    SELECT score, DENSE_RANK() OVER(ORDER BY score DESC) AS 'rank'
    FROM Scores
    
status = success

#### <u>notes</u>

this question was tricky because without knowledge of the RANK() & DENSE_RANK() functions, it wouldn't have been feasible to solve this

there is an overview of SQL RANK functions here: https://www.sqlshack.com/overview-of-sql-rank-functions/

it would be useful to understand better the OVER() function (how does it know what to go over without a partition?) as well as how to effectively use PARTITION for more complex problems

### 180. Consecutive Numbers@ <- explanation for various solutions incomplete

#### <u>description</u>

Table: Logs

    +-------------+---------+
    | Column Name | Type    |
    +-------------+---------+
    | id          | int     |
    | num         | varchar |
    +-------------+---------+
In SQL, id is the primary key for this table.
id is an autoincrement column.
 

Find all numbers that appear at least three times consecutively.

Return the result table in any order.

#### <u>attempts</u>

NOTE: honestly not entirely sure how my query works or why exactly it is failing...

    SELECT DISTINCT num AS ConsecutiveNums FROM (
        SELECT *, ROW_NUMBER() OVER(PARTITION BY num ORDER BY id) AS counter
        FROM Logs
    ) AS sub
    WHERE counter >= 3
    
status = failure

#### <u>solutions</u>
there's tons of solutions, here's a few

Approach 1 - using joins (very slow...)

    SELECT DISTINCT l1.num AS ConsecutiveNums
    FROM Logs l1
    JOIN Logs l2 ON l1.id = l2.id - 1
    JOIN Logs l3 ON l1.id = l3.id - 2
    WHERE l1.num = l2.num AND l2.num = l3.num;

Approach 2 - using LEAD and LAG (pretty decent)

    SELECT DISTINCT num AS ConsecutiveNums
    FROM (
        SELECT 
            LAG(id) OVER (ORDER BY id) AS prev_id,
            id,
            LEAD(id) OVER (ORDER BY id) AS next_id,
            LAG(num) OVER (ORDER BY id) AS prev_num,
            num,
            LEAD(num) OVER (ORDER BY id) AS next_num
        FROM logs
    ) subquery
    WHERE prev_num = num 
      AND num = next_num
      AND next_id - id = 1 
      AND id - prev_id = 1;

Approach 3 - using EXISTS and SUBQUERY (also decent)

    SELECT DISTINCT l1.num AS ConsecutiveNums
    FROM Logs l1
    WHERE EXISTS (
        SELECT 1
        FROM Logs l2
        WHERE l2.id = l1.id + 1 AND l2.num = l1.num
        AND EXISTS (
            SELECT 1
            FROM Logs l3
            WHERE l3.id = l1.id + 2 AND l3.num = l1.num
        )
    );

#### <u>notes</u>

this was the output of my subquery in my attempt:

    | id | num | counter |
    | -- | --- | ------- |
    | 1  | 1   | 1       |
    | 2  | 1   | 2       |
    | 3  | 1   | 3       |
    | 5  | 1   | 4       |
    | 4  | 2   | 1       |
    | 6  | 2   | 2       |
    | 7  | 2   | 3       |
    
don't really understand how the ORDER BY here works considering it's not ordered by id. 

partitioning by id gave the following result, which makes even less sense to me:

    | id | num | counter |
    | -- | --- | ------- |
    | 1  | 1   | 1       |
    | 2  | 1   | 1       |
    | 3  | 1   | 1       |
    | 4  | 2   | 1       |
    | 5  | 1   | 1       |
    | 6  | 2   | 1       |
    | 7  | 2   | 1       |
    
something i'm really not understanding about ROW_NUMBER()

explanation for the solutions. there is tons to unpack here...

* Approach 1.

    [...]
* Approach 2.

    [...]
* Approach 3.

    [...[]

## Hard Problems